#include <stdio.h>
int main(){
    double a, n, b, S, P;

    printf("Введите длину стороны a: ");
    scanf("%lf", &a);
/**
 * @brief Точка входа в программу
 *
 * @return 0 в случае успешного завершения программы
 */
int main()
{
    // Объявляем переменные
    double v_boat;    // Скорость лодки в стоячей воде
    double v_current; // Скорость течения реки
    double t;         // Время движения
    double s;         // Пройденный путь

    printf(введиье длину коэффициент n:);
    scanf("%lf", &n);
    // Вводим исходные данные
    printf("Введите скорость лодки в стоячей воде: ");
    scanf("%lf", &v_boat);

    b = a * n / 100.0
    S = a * b;
    P = 2 * (a + b);
    printf("Введите скорость течения реки: ");
    scanf("%lf", &v_current);

    printf("Вторая сторона b = %.2f\n", b);
    printf("Площадь прямоугольника S = %.2f\n", S);
    printf("Периметр прямоугольника p = %.2f\n", P);
    printf("Введите время движения: ");
    scanf("%lf", &t);

    // Вычисляем скорость лодки по течению
    double v = v_boat + v_current;

    // Вычисляем пройденный путь
    s = v * t;

    // Выводим результат
    printf("Путь, пройденный лодкой: %lf\n", s);

    return 0;
}
